#   &emsp; &emsp; &emsp; &emsp; &emsp; &emsp; &emsp; &emsp; &emsp; &emsp; Assignment
### Q1 : Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series ?
### Ans :- 
**Series :**<br>
**A Pandas Series is a one-dimensional labeled array that can hold any data type, including numerical, string, or even mixed data. It can be created from a list, dictionary, or scalar value and has a label associated with each element, which is known as the index.**
**--> A Series cannot contain multiple columns. It has the following parameter:**<br>
**data: It can be any list, dictionary, or scalar value.<br>
index: The value of the index should be unique and hashable. It must be of the same length as data. If we do not pass any <br>index, default np.arrange(n) will be used.**
**dtype: It refers to the data type of series.**<br>
**copy: It is used for copying the data.**

**Creating a Series:**

In [1]:
import pandas as pd

In [2]:
data = [ 4, 8, 15, 16, 23, 42]

ser = pd.Series(data)
print(ser)

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

**Creating Series from Array:**<br>
**NumPy: NumPy is a Python library used for working with arrays.**

In [3]:

import pandas as pd
 
# import numpy as np
import numpy as np
 
# simple array
data = np.array([ 4, 8, 15, 16, 23, 42])
 
# providing an index
ser = pd.Series(data, index=[10, 11, 12, 13, 14, 15])
print(ser)

10     4
11     8
12    15
13    16
14    23
15    42
dtype: int64

### Q2 : Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the
### variable print it ?
### Ans :-

In [4]:
import pandas as pd
 
# a simple list
my_list = ['g', 'e', 'f', 'k', 's', 'q', 'e', 'h', 't', 'a']

In [5]:
type(my_list)

list

In [6]:
# create series form a list
my_series = pd.Series(my_list)
print(my_series)

0    g
1    e
2    f
3    k
4    s
5    q
6    e
7    h
8    t
9    a
dtype: object

### Q3 : Create a Pandas DataFrame that contains the following data ?
### Ans :-

In [7]:
import pandas as pd

data = {'Name':['Alice', 'Bob', 'Claire'],
        'Age': [25, 30, 27],
        'Gender': ['Female', 'Male', 'Female']}

In [8]:
df = pd.DataFrame(data)

In [9]:
print(df)

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

### Q4 : What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example ?
### Ans :-
**DataFrame : <br>**
**Pandas DataFrame is a widely used data structure which works with a two-dimensional array with labeled axes (rows and columns).It is similar to a table or spreadsheet in which data is arranged in rows and columns. A DataFrame allows for easy manipulation and analysis of structured data.**<br>

**It consists of the following properties:**<br>

**(i) The columns can be heterogeneous types like int, bool, and so on.<br>**
**It can be seen as a dictionary of Series structure where both the rows and columns are indexed. It is denoted as "columns" in case of columns and "index" in case of rows.**<br>

**Difference between DataFrame and Series :<br>**
| **Aspect**               | **DataFrame**                              | **Series**                                 |
|--------------------------|---------------------------------------------|---------------------------------------------|
| **Dimension**            | 2-dimensional (rows and columns)           | 1-dimensional (single column or row)       |
| **Basic Structure**      | Table-like structure with columns           | Single column or row with labels           |
| **Data Representation**  | Can hold multiple columns of different types| Single column of data                       |
| **Initialization**       | Created from dictionaries, lists, arrays    | Created from lists, arrays, or other data   |
| **Accessing Elements**   | Accessed using column names or indexes      | Accessed using indexes or labels            |
| **Example**              | `pd.DataFrame({'A': [1, 2], 'B': [3, 4]})` | `pd.Series([1, 2, 3, 4], name='MySeries')` |
| **Usage**                | Suitable for structured, tabular data       | Used for representing single variables     |
| **Functionality**        | Supports complex operations and manipulations | Supports basic operations and manipulations |
| **Shape**                | Represented as (rows, columns)               | Represented as (length,) or (1, length)    |

### Example :-

In [10]:
import pandas as pd

# Creating a Series
s = pd.Series([1, 2, 3, 4], name='MySeries')

In [11]:
print(s)

0    1
1    2
2    3
3    4
Name: MySeries, dtype: int64

In [12]:
# Creating a DataFrame
df = pd.DataFrame({'Column1': [10, 20, 30, 40], 'Column2': ['A', 'B', 'C', 'D']})

In [13]:
print(df)

   Column1 Column2
0       10       A
1       20       B
2       30       C
3       40       D

### Q5 : What are some common functions you can use to manipulate data in a Pandas DataFrame? Can you give an example of when you might use one of these functions?
### Ans :-

In [14]:
import pandas as pd
import numpy as np

# DataFrame
data = {
    'Name': ['Alice', 'Bob', 'Claire', 'David', 'Eva'],
    'Age': [25, 30, 27, np.nan, 22],
    'Gender': ['Female', 'Male', 'Female', 'Male', 'Female'],
    'Salary': [50000, 60000, 55000, 70000, np.nan]
}

df = pd.DataFrame(data)

In [15]:
df

     Name   Age  Gender   Salary
0   Alice  25.0  Female  50000.0
1     Bob  30.0    Male  60000.0
2  Claire  27.0  Female  55000.0
3   David   NaN    Male  70000.0
4     Eva  22.0  Female      NaN

**(1) head() and tail(): Display the first or last N rows of the DataFrame.**

In [16]:
df.head(3)  # Display the first 3 rows

     Name   Age  Gender   Salary
0   Alice  25.0  Female  50000.0
1     Bob  30.0    Male  60000.0
2  Claire  27.0  Female  55000.0

In [17]:
df.tail(2) # Display the last 2 rows

    Name   Age  Gender   Salary
3  David   NaN    Male  70000.0
4    Eva  22.0  Female      NaN

**(2) info(): Provides a concise summary of the DataFrame, including data types and missing values.**

In [18]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    5 non-null      object
 1   Age     4 non-null      float64
 2   Gender  5 non-null      object
 3   Salary  4 non-null      float64
dtypes: float64(2), object(2)
memory usage: 288.0+ bytes

**(3) describe(): Generates descriptive statistics of the DataFrame.**

In [19]:
df.describe()

             Age        Salary
count   4.000000      4.000000
mean   26.000000  58750.000000
std     3.366502   8539.125638
min    22.000000  50000.000000
25%    24.250000  53750.000000
50%    26.000000  57500.000000
75%    27.750000  62500.000000
max    30.000000  70000.000000

**(4) filter(): Filters rows of the DataFrame based on a condition.**

In [20]:
df[df['Age'] > 22]

     Name   Age  Gender   Salary
0   Alice  25.0  Female  50000.0
1     Bob  30.0    Male  60000.0
2  Claire  27.0  Female  55000.0

**(5) drop(): Drops specified labels from rows or columns.**

In [21]:
df.drop(columns=['Gender'])

     Name   Age   Salary
0   Alice  25.0  50000.0
1     Bob  30.0  60000.0
2  Claire  27.0  55000.0
3   David   NaN  70000.0
4     Eva  22.0      NaN

**(6) fillna() and dropna(): Fills or drops missing values.**

In [23]:
df['Salary'].fillna(df['Salary'].mean(), inplace=True)

In [24]:
df

     Name   Age  Gender   Salary
0   Alice  25.0  Female  50000.0
1     Bob  30.0    Male  60000.0
2  Claire  27.0  Female  55000.0
3   David   NaN    Male  70000.0
4     Eva  22.0  Female  58750.0

**(7) pivot_table(): Creates a pivot table based on column values.**

In [25]:
# Create a pivot table based on 'Gender' and calculate the mean salary
pivot_table_result = pd.pivot_table(df, values='Salary', index='Gender', aggfunc=np.mean)

# Display the pivot table
print("Pivot Table:")
print(pivot_table_result)

Pivot Table:
              Salary
Gender
Female  54583.333333
Male    65000.000000

**(8) sort_values(): Sort the DataFrame by 'Age' in descending order**

In [28]:
sorted_df = df.sort_values(by='Age', ascending=False)

In [29]:
sorted_df

     Name   Age  Gender   Salary
1     Bob  30.0    Male  60000.0
2  Claire  27.0  Female  55000.0
0   Alice  25.0  Female  50000.0
4     Eva  22.0  Female  58750.0
3   David   NaN    Male  70000.0

### Q6 : Which of the following is mutable in nature Series, DataFrame, Panel?
### Ans :-Pandas deals with the following three data structures −

**(1) Series<br>**
**(2) DataFrame<br>**
**(3) Panel<br>**
**These data structures are built on top of Numpy array, which means they are fast.<br>**

**Mutability<br>**
**All Pandas data structures are value mutable (can be changed) and except Series <br>all are size mutable. Series is size immutable.**<br>
**Size Mutable: <br>You can change the structure (add or remove elements) of the data structure.**<br>
**Data Mutable: <br>You can change the values within the data structure.**<br>

**(1) Series :**<br>
**Series is a one-dimensional array like structure with homogeneous data.**<br>
**Once a Series is created, you cannot change its size (i.e., add or remove elements). However, you can modify the values within the Series.**<br>
 
**Key Points :**<br>
**(i) Homogeneous data**<br>
**(ii) Size Immutable**<br>
**(iii) Values of Data Mutable**<br>

### Example :-

In [13]:
import pandas as pd

# Creating a Series
s = pd.Series([10, 23, 56, 17, 52])

In [18]:
# Adding a new element to the Series
s2 = pd.concat([s, pd.Series([99])])

In [19]:
print("Original Series:")
print(s)

Original Series:
0    10
1    23
2    56
3    17
4    52
dtype: int64

In [20]:
print("Series after appending a new element:")
print(s2)

Series after appending a new element:
0    10
1    23
2    56
3    17
4    52
0    99
dtype: int64

**(2) DataFrame :**<br>
**DataFrame is a two-dimensional array with heterogeneous data.**<br>
**Both the size of a DataFrame and the values within it can be changed. You can add or remove columns and rows, and you can modify the values.**<br>

**Key Points :**<br>
**(i) Heterogeneous data**<br>
**(ii) Size Mutable**<br>
**(iii) Data Mutable**<br>

### Example :-

In [21]:
import pandas as pd

# Creating a DataFrame
data = {
    'Name': ['Alice', 'Bob', 'Claire'],
    'Age': [25, 30, 27],
    'Gender': ['Female', 'Male', 'Female']
}

df = pd.DataFrame(data)

In [22]:
df

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

In [23]:
# Size of DataFrame is mutable
df['Salary'] = [50000, 60000, 55000]

In [24]:
df

     Name  Age  Gender  Salary
0   Alice   25  Female   50000
1     Bob   30    Male   60000
2  Claire   27  Female   55000

In [28]:
# put value at index 1 
df.loc[1, 'Age'] = 35

In [29]:
df

     Name  Age  Gender  Salary
0   Alice   25  Female   50000
1     Bob   35    Male   60000
2  Claire   27  Female   55000

**(3) Panel :**<br>
**Panel is a three-dimensional data structure with heterogeneous data. It is hard to represent the panel in graphical representation. But a panel can be illustrated as a container of DataFrame.**<br>
**Similar to DataFrames, the size of a Panel and the values within it can be changed.**<br>

**Key Points :**<br>
**(i) Heterogeneous data**<br>
**(ii) Size Mutable**<br>
**(iii )Data Mutable**

### Q7 : Create a DataFrame using multiple Series. Explain with an example ?
### Ans :-

In [31]:
import pandas as pd

# creating 3 Series 
city_series = pd.Series(['New York', 'San Francisco', 'Los Angeles'])
population_series = pd.Series([8398748, 883305, 3990456])
area_series = pd.Series([468.9, 46.87, 1302])

In [32]:
# Creating a DataFrame using the Series
cities_df = pd.DataFrame({
    'City': city_series,
    'Population': population_series,
    'Area (sq. miles)': area_series
})

In [34]:
cities_df

            City  Population  Area (sq. miles)
0       New York     8398748            468.90
1  San Francisco      883305             46.87
2    Los Angeles     3990456           1302.00